/**
 * [aadata description]
 * 文书对应字典数据
 * @type {Object}
 */
const aadata = {
    //用药单位
    drugDoseageUnit: {
        '01': '毫克(mg)',
        '02': '克(g)',
        '03': '毫升(ml)',
        '04': '片',
        '05': '(U)'
    },
    //性别
    sex: {
        '0': '未知的性别',
        '1': '男性',
        '2': '女性',
        '9': '未说明性别'
    },
    //吸烟状况
    somke: {
        '1': '现在每天吸',
        '2': '现在吸,但不是每天吸',
        '3': '过去吸,但现在不吸',
        '4': '从不吸'
    },
    //饮酒
    drink: {
        //饮酒频率
        freq: {
            '1': '从不',
            '2': '偶尔',
            '3': '经常',
            '4': '每天',
            '21': '1d/月~3d/月',
            '22': '少于1d/月',
            '31': '5d/周~6d/周',
            '32': '3d/周~4d/周',
            '33': '1d/周~2d/周'
        },
        //种类
        type: {
            '1': '白酒',
            '2': '啤酒',
            '3': '红酒',
            '4': '黄酒',
            '5': '其他',
            '11': '白酒（≥42度）',
            '12': '白酒（＜42度）'
        },
        // 标志
        flag: {
            '1': '白酒（≥42度）',
            '2': '白酒（＜42度）',
            '3': '啤酒',
            '4': '黄酒，米酒',
            '5': '葡萄酒',
            '9': '其他',
            '10': '不饮酒'
        }
    },
    //饮食
    eat: {
        '1': ' 荤素均衡',
        '2': ' 荤食为主',
        '3': ' 素食为主',
        '4': ' 嗜盐',
        '5': ' 嗜油',
        '6': ' 嗜糖'
    },
    //运动方式
    exercise: {
        //频率
        freq: {
            '1': '每天',
            '2': '每周一次以上',
            '3': '偶尔',
            '4': '不运动',
            '21': '5次/周~6次/周',
            '22': '3次/周~4次/周',
            '23': '1次/周~2次/周',
            '31': '1次/月~3次/月',
            '32': '少于1次/月'
        }
    },
    //糖尿病
    diabetes: {
        //并发症种类
        compType: {
            '1': '糖尿病性眼病',
            '2': '糖尿病性心脏病',
            '3': '糖尿病性神经病变',
            '4': '糖尿病性肾病',
            '5': '糖尿病足',
            '6': '糖尿病性性功能障碍'
        }
    },
    //1、门诊，2、急诊，3、住院，4、体检
    opEmHpExMark: {
        '1': '门诊',
        '2': '急诊',
        '3': '住院',
        '4': '体检'
    },
    //民族
    nation: {
        '01': '汉族',
        '02': '蒙古族',
        '03': '回族',
        '04': '藏族',
        '05': '维吾尔族',
        '06': '苗族',
        '07': '彝族',
        '08': '壮族',
        '09': '布依族',
        '10': '朝鲜族',
        '11': '满族',
        '12': '侗族',
        '13': '瑶族',
        '14': '白族',
        '15': '土家族',
        '16': '哈尼族',
        '17': '哈萨克族',
        '18': '傣族',
        '19': '黎族',
        '20': '僳僳族',
        '21': '佤族',
        '22': '畲族',
        '23': '高山族',
        '24': '拉祜族',
        '25': '水族',
        '26': '东乡族',
        '27': '纳西族',
        '28': '景颇族',
        '29': '柯尔克孜族',
        '30': '土族',
        '31': '达斡尔族',
        '32': '仫佬族',
        '33': '羌族',
        '34': '布朗族',
        '35': '撤拉族',
        '36': '毛难族',
        '37': '仡佬族',
        '38': '锡伯族',
        '39': '阿昌族',
        '40': '普米族',
        '41': '塔吉克族',
        '42': '怒族',
        '43': '乌孜别克族',
        '44': '俄罗斯族',
        '45': '鄂温克族',
        '46': '崩龙族',
        '47': '保安族',
        '48': '裕固族',
        '49': '京族',
        '50': '塔塔尔族',
        '51': '独龙族',
        '52': '鄂伦春族',
        '53': '赫哲族',
        '54': '门巴族',
        '55': '珞巴族',
        '56': '基诺族',
        '98': '外籍',
        '99': '不详'
    },
    //文化程度
    whcd: {
        '1': '研究生',
        '2': '大学本科',
        '3': '大学专科和专科学校',
        '4': '中等专业学校',
        '5': '技工学校',
        '6': '高中',
        '7': '初中',
        '8': '小学',
        '9': '文盲或半文盲'
    },
    //孕产高危因素
    ycgw: {
        '01': '年龄<18岁或≥35岁',
        '02': '身高≤1.45m',
        '03': '体重(⑽kg或)gOkg',
        '04': '胸廓脊柱畸形',
        '05': '自然流产≥2次',
        '06': '人工流产≥2次',
        '07': '早产史≥2次',
        '08': '早期新生儿死亡史1次',
        '09': '死胎、死产史≥2次',
        '10': '先天异常儿史1次',
        '11': '先天异常儿史≥2次',
        '12': '难产史',
        '13': '巨大儿分娩史',
        '14': '产后出血史',
        '15': '贫血血红蛋白<100g/L',
        '16': '贫血血红蛋白<60g/L',
        '17': '活动性肺结核',
        '18': '心脏病心功能I-Ⅱ级',
        '19': '心脏病心功能Ⅲ级-Ⅳ级',
        '20': '榜尿病',
        '21': '乙肝病毒携带者',
        '22': '活动性病毒性肝炎',
        '23': '肺心病',
        '24': '甲状腺功能亢进或低下',
        '25': '高血压',
        '26': '慢性肾炎',
        '27': '淋病',
        '28': '梅毒',
        '29': '艾滋病',
        '30': '尖锐湿疣',
        '31': '沙眼衣原体感染',
        '32': '骶耻外径<18cm',
        '33': '坐骨结节间径≤8cm',
        '34': '畸形骨盆',
        '35': '臀位、横位(30周后)',
        '36': '先兆早产<34周',
        '37': '先兆早产34-36周+6d',
        '38': '盆腔肿瘤',
        '39': '羊水过多或过少',
        '40': '妊娠期高血压、轻度子痫前期',
        '41': '重度子痫前期',
        '42': '子痫',
        '43': '妊娠晚期阴道流血',
        '44': '胎心率持续≥160次/min',
        '45': '胎心率≤120次/min、但>100次/min',
        '46': '胎心率≤100次/min',
        '47': '胎动<20次/12h',
        '48': '胎动<10次/12h',
        '49': '多胎',
        '50': '胎膜早破',
        '51': '估计巨大儿或IUGR',
        '52': '妊娠41-41周+6d',
        '53': '妊娠≥42周',
        '54': '母儿ABO血型不合',
        '55': '母儿Rh血型不合',
        '56': '孕妇及一级亲属有遗传病史',
        '57': '妊娠早期接触可疑致畸药物',
        '58': '妊娠早期接触物理化学因紊及病毒感染等',
        '59': '家庭贫因',
        '60': '孕妇或丈夫为文盲或半文盲',
        '61': '丈夫长期不在家',
        '62': '由居住地到卫生院需要1h以上',
        '63': '生殖道畸形',
        '64': '妊娠胆汁淤积症'
    },
    //卡类型
    klx: {
        '0': '社保卡',
        '1': '医保卡',
        '2': '统一自费就诊卡',
        '3': '医院自费卡',
        '4': '区内统一自费就诊卡',
        '5': '新农合卡',
        '6': '居民健康卡',
        '9': '其他卡'
    },
    //手术
    oper: {
        //切口愈合等级
        woundGrade: {
            '1': '甲',
            '2': '乙',
            '3': '丙',
            '9': '其他'
        }
    },
    //医疗费用分类
    payMode: {
        '01': '城镇职工基本医疗保险',
        '02': '城镇居民基本医疗保险',
        '03': '新型农村合作医疗',
        '04': '贫困救助',
        '05': '商业医疗保险',
        '06': '全公费',
        '07': '全自费',
        '08': '其他社会保险',
        '99': '其他'
    },
    //婚姻
    marry: {
        '1': '未婚',
        '2': '已婚',
        '3': '丧偶',
        '4': '离婚',
        '9': '其他'
    },
    //从业-职业
    practJob: {
        '11': '国家公务员',
        '13': '专业技术人员',
        '17': '职员',
        '21': '企业管理人员',
        '24': '工人',
        '27': '农民',
        '31': '学生',
        '37': '现役军人',
        '51': '自由职业者',
        '54': '个体经营者',
        '70': '无业人员',
        '80': '退（离）休人员',
        '99': '其他'
    },
    //家庭关系
    familyRelation: {
        '0': '本人',
        '01': '本人',
        '02': '户主',
        '1': '配偶',
        '11': '夫',
        '12': '妻',
        '2': '子',
        '21': '独生子',
        '22': '长子',
        '23': '次子',
        '24': '三子',
        '25': '四子',
        '26': '五子',
        '27': '养子或继子',
        '28': '女婿',
        '29': '其他儿子',
        '3': '女',
        '31': '独生女',
        '32': '长女',
        '33': '次女',
        '34': '三女',
        '35': '四女',
        '36': '五女',
        '37': '养女或继女',
        '38': '儿媳',
        '39': '其他女儿',
        '4': '孙子、孙女或外孙子、外孙女',
        '41': '孙子',
        '42': '孙女',
        '43': '外孙子',
        '44': '外孙女',
        '45': '孙媳妇',
        '46': '孙女婿',
        '47': '曾孙子或外曾孙子',
        '48': '曾孙女或外曾孙女',
        '49': '其他孙子、孙女或外孙子、外孙女',
        '5': '父母',
        '51': '父亲',
        '52': '母亲',
        '53': '公公',
        '54': '婆婆',
        '55': '岳父',
        '56': '岳母',
        '57': '继父或养父',
        '58': '继母或养母',
        '59': '其他父母关系',
        '6': '祖父母或外祖父母',
        '61': '祖父',
        '62': '祖母',
        '63': '外祖父',
        '64': '外祖母',
        '65': '配偶的祖父母或外祖父母',
        '66': '曾祖父',
        '67': '曾祖母',
        '68': '配偶的曾祖父母或外曾祖父母',
        '69': '其他祖父母或外祖父母',
        '7': '兄、弟、姐、妹',
        '71': '兄',
        '72': '嫂',
        '73': '弟',
        '74': '弟媳',
        '75': '姐姐',
        '76': '姐夫',
        '77': '妹妹',
        '78': '妹夫',
        '79': '其他兄弟姐妹',
        '8': '其他',
        '81': '伯父',
        '82': '伯母',
        '83': '叔父',
        '84': '婶母',
        '85': '舅父',
        '86': '舅母',
        '87': '姨父',
        '88': '姨母',
        '89': '姑父',
        '90': '姑母',
        '91': '堂兄弟',
        '92': '表兄弟',
        '93': '侄子',
        '94': '侄女',
        '95': '外甥',
        '96': '外甥女',
        '97': '其他亲属',
        '99': '非亲属'
    },
    //医疗付费方式
    payMode: {
        '01': '城镇职工基本医疗保险',
        '02': '城镇居民基本医疗保险',
        '03': '新型农村合作医疗',
        '04': '贫困救助',
        '05': '商业医疗保险',
        '06': '全公费',
        '07': '全自费',
        '08': '其他社会保险',
        '99': '其他'
    },
    zz: {
        '1': '无症状',
        '2': '多饮',
        '3': '多食',
        '4': '多尿',
        '5': '视力模糊',
        '6': '感染',
        '7': '手脚麻木',
        '8': '下肢浮肿',
        '9': '体重明显下降',
        '10': '其他症状'
    },
    gxyzz: {
        '1': '头痛头晕',
        '2': '恶心呕吐',
        '3': '眼花耳鸣',
        '4': '呼吸困难',
        '5': '心悸胸闷',
        '6': '鼻衄出血不止',
        '7': '四肢发麻',
        '8': '下肢水肿',
        '9': '无症状',
        '10': '其他'
    },
    //肿瘤患者治疗方式代码表
    zlzlfs: {
        '01': '手术',
        '02': '化疗',
        '03': '放疗',
        '04': '中药',
        '05': '免疫',
        '06': '介入',
        '07': '止痛治疗',
        '08': '未治疗',
        '99': '其他治疗'
    },
    // 肿瘤患者指导内容
    zlzdnr: {
        '01': '督导随访',
        '02': '用药',
        '03': '饮食',
        '04': '康复',
        '05': '家床',
        '06': '住院',
        '07': '出诊'
    },
    // 肿瘤诊断依据
    zlzdyj: {
        '01': '临床',
        '02': 'X线',
        '03': '超声波',
        '04': 'CT',
        '05': '内窥镜',
        '06': '核磁共振',
        '07': '手术(无病理)',
        '08': '尸检(无病理)',
        '09': '生化',
        '10': '免疫',
        '11': '血片',
        '12': '细胞学',
        '13': '病理(继发)',
        '14': '病理(原发)',
        '15': '尸检(有病理)',
        '16': '不详',
        '17': '死亡补发病'
    },
    // 肿瘤患者目前疾病情况
    zlmqqk: {
        '1': '稳定',
        '2': '好转',
        '3': '恶化'
    },
    //肿瘤确诊时期别
    zlqzsqb: {
        '1': '0期',
        '2': 'Ⅰ期',
        '3': 'Ⅱ期',
        '4': 'Ⅲ期',
        '5': 'Ⅳ期',
        '6': '无法判定'
    }
}

export default aadata
